app/controllers/api_geek_controller.rb

SELECT  1 AS one FROM "videos" WHERE "videos"."video_id" = ? LIMIT 1  [["video_id", 7127]]
SELECT "videos".* FROM "videos"
INSERT INTO "videos" ("video_id", "title", "event", "abstract", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["video_id", 7127], ["title", "Build anything"], ["event", "JSConf uS2012"], ["abstract", ""], ["created_at", "2016-04-13 18:18:46.301056"], ["updated_at", "2016-04-13 18:18:46.301056"]]
---
	def getVideo
		@result = Net::HTTP.get('confreaks.tv' ,'/api/v1/videos.json?limit=50')
		@resultSet = JSON.parse(@result)

		@resultSet.each do |i|
			unless Video.exists?(video_id: i["id"])
				Video.create(video_id: i["id"], title: i["title"], event: i["event"] ,abstract: i["abstract"])